Aanvragen.Web/UploadDir/201709211739-cmdb_ci_request templ.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ucm="http://www.service-now.com/ucmdb_integ_ci">
   <soapenv:Header/>
   <soapenv:Body>
      <ucm:insertMultiple>
         <!--1 or more repetitions:-->
         <record>
            <!--Optional:-->
            <asset>?</asset>
            <!--Optional:-->
            <asset_tag>?</asset_tag>
            <!--Optional:-->
            <assigned>?</assigned>
            <!--Optional:-->
            <assigned_to>?</assigned_to>
            <!--Optional:-->
            <assignment_group>?</assignment_group>
            <!--Optional:-->
            <attributes>?</attributes>
            <!--Optional:-->
            <can_print>?</can_print>
            <!--Optional:-->
            <category>?</category>
            <!--Optional:-->
            <change_control>?</change_control>
            <!--Optional:-->
            <checked_in>?</checked_in>
            <!--Optional:-->
            <checked_out>?</checked_out>
            <!--Optional:-->
            <comments>?</comments>
            <!--Optional:-->
            <company>?</company>
            <!--Optional:-->
            <correlation_id>?</correlation_id>
            <!--Optional:-->
            <cost>?</cost>
            <!--Optional:-->
            <cost_cc>?</cost_cc>
            <!--Optional:-->
            <cost_center>?</cost_center>
            <!--Optional:-->
            <delivery_date>?</delivery_date>
            <!--Optional:-->
            <department>?</department>
            <!--Optional:-->
            <discovery_source>?</discovery_source>
            <!--Optional:-->
            <dns_domain>?</dns_domain>
            <!--Optional:-->
            <due>?</due>
            <!--Optional:-->
            <due_in>?</due_in>
            <!--Optional:-->
            <fault_count>?</fault_count>
            <!--Optional:-->
            <first_discovered>?</first_discovered>
            <!--Optional:-->
            <fqdn>?</fqdn>
            <!--Optional:-->
            <gl_account>?</gl_account>
            <!--Optional:-->
            <import_set_run>?</import_set_run>
            <!--Optional:-->
            <install_date>?</install_date>
            <!--Optional:-->
            <install_status>?</install_status>
            <!--Optional:-->
            <invoice_number>?</invoice_number>
            <!--Optional:-->
            <ip_address>?</ip_address>
            <!--Optional:-->
            <justification>?</justification>
            <!--Optional:-->
            <last_discovered>?</last_discovered>
            <!--Optional:-->
            <lease_id>?</lease_id>
            <!--Optional:-->
            <location>?</location>
            <!--Optional:-->
            <mac_address>?</mac_address>
            <!--Optional:-->
            <maintenance_schedule>?</maintenance_schedule>
            <!--Optional:-->
            <managed_by>?</managed_by>
            <!--Optional:-->
            <manufacturer>?</manufacturer>
            <!--Optional:-->
            <model_id>?</model_id>
            <!--Optional:-->
            <model_number>?</model_number>
            <!--Optional:-->
            <monitor>?</monitor>
            <!--Optional:-->
            <name>?</name>
            <!--Optional:-->
            <operational_status>?</operational_status>
            <!--Optional:-->
            <order_date>?</order_date>
            <!--Optional:-->
            <owned_by>?</owned_by>
            <!--Optional:-->
            <po_number>?</po_number>
            <!--Optional:-->
            <purchase_date>?</purchase_date>
            <!--Optional:-->
            <schedule>?</schedule>
            <!--Optional:-->
            <serial_number>?</serial_number>
            <!--Optional:-->
            <short_description>?</short_description>
            <!--Optional:-->
            <skip_sync>?</skip_sync>
            <!--Optional:-->
            <start_date>?</start_date>
            <!--Optional:-->
            <subcategory>?</subcategory>
            <!--Optional:-->
            <support_group>?</support_group>
            <!--Optional:-->
            <supported_by>?</supported_by>
            <!--Optional:-->
            <template_import_log>?</template_import_log>
            <!--Optional:-->
            <u_adam>?</u_adam>
            <!--Optional:-->
            <u_afgiftepunt>?</u_afgiftepunt>
            <!--Optional:-->
            <u_atlantis_aan>?</u_atlantis_aan>
            <!--Optional:-->
            <u_baan_id>?</u_baan_id>
            <!--Optional:-->
            <u_baan_info_old>?</u_baan_info_old>
            <!--Optional:-->
            <u_barcodereader>?</u_barcodereader>
            <!--Optional:-->
            <u_bekabeling>?</u_bekabeling>
            <!--Optional:-->
            <u_ci_type>?</u_ci_type>
            <!--Optional:-->
            <u_cicokop>?</u_cicokop>
            <!--Optional:-->
            <u_contract_number>?</u_contract_number>
            <!--Optional:-->
            <u_contractual_status>?</u_contractual_status>
            <!--Optional:-->
            <u_dc_pkisam>?</u_dc_pkisam>
            <!--Optional:-->
            <u_disc_contact>?</u_disc_contact>
            <!--Optional:-->
            <u_disc_loc>?</u_disc_loc>
            <!--Optional:-->
            <u_disc_model>?</u_disc_model>
            <!--Optional:-->
            <u_disc_vendor>?</u_disc_vendor>
            <!--Optional:-->
            <u_dns1>?</u_dns1>
            <!--Optional:-->
            <u_dns2>?</u_dns2>
            <!--Optional:-->
            <u_dns3>?</u_dns3>
            <!--Optional:-->
            <u_dns4>?</u_dns4>
            <!--Optional:-->
            <u_domain_nameserver>?</u_domain_nameserver>
            <!--Optional:-->
            <u_environment>?</u_environment>
            <!--Optional:-->
            <u_et_balie>?</u_et_balie>
            <!--Optional:-->
            <u_ett_gateway>?</u_ett_gateway>
            <!--Optional:-->
            <u_ett_hostname>?</u_ett_hostname>
            <!--Optional:-->
            <u_ett_ip_address>?</u_ett_ip_address>
            <!--Optional:-->
            <u_ett_naam>?</u_ett_naam>
            <!--Optional:-->
            <u_ett_netmask>?</u_ett_netmask>
            <!--Optional:-->
            <u_external_id>?</u_external_id>
            <!--Optional:-->
            <u_gateway>?</u_gateway>
            <!--Optional:-->
            <u_has_heater>?</u_has_heater>
            <!--Optional:-->
            <u_hasblindledstrip>?</u_hasblindledstrip>
            <!--Optional:-->
            <u_height>?</u_height>
            <!--Optional:-->
            <u_hostname>?</u_hostname>
            <!--Optional:-->
            <u_hpe_ci_type>?</u_hpe_ci_type>
            <!--Optional:-->
            <u_installation_name_ci>?</u_installation_name_ci>
            <!--Optional:-->
            <u_ip_address>?</u_ip_address>
            <!--Optional:-->
            <u_ip_address_opbb50>?</u_ip_address_opbb50>
            <!--Optional:-->
            <u_ip_adres_brother>?</u_ip_adres_brother>
            <!--Optional:-->
            <u_kaartlezer_versie>?</u_kaartlezer_versie>
            <!--Optional:-->
            <u_kg2>?</u_kg2>
            <!--Optional:-->
            <u_kg2_to_brother>?</u_kg2_to_brother>
            <!--Optional:-->
            <u_left_cabinet_id>?</u_left_cabinet_id>
            <!--Optional:-->
            <u_lenght>?</u_lenght>
            <!--Optional:-->
            <u_locatie_j_n>?</u_locatie_j_n>
            <!--Optional:-->
            <u_location_details_ci>?</u_location_details_ci>
            <!--Optional:-->
            <u_loket_nummer>?</u_loket_nummer>
            <!--Optional:-->
            <u_lowgate>?</u_lowgate>
            <!--Optional:-->
            <u_netmask>?</u_netmask>
            <!--Optional:-->
            <u_nnm_uid>?</u_nnm_uid>
            <!--Optional:-->
            <u_notes>?</u_notes>
            <!--Optional:-->
            <u_number_of_validators>?</u_number_of_validators>
            <!--Optional:-->
            <u_objectsoort_code>?</u_objectsoort_code>
            <!--Optional:-->
            <u_os>?</u_os>
            <!--Optional:-->
            <u_os_version>?</u_os_version>
            <!--Optional:-->
            <u_pin_device_ip>?</u_pin_device_ip>
            <!--Optional:-->
            <u_pinpad_software>?</u_pinpad_software>
            <!--Optional:-->
            <u_pinterminal_verbinding>?</u_pinterminal_verbinding>
            <!--Optional:-->
            <u_pki_sam>?</u_pki_sam>
            <!--Optional:-->
            <u_pkisam_betaald>?</u_pkisam_betaald>
            <!--Optional:-->
            <u_pkisam_onbetaald>?</u_pkisam_onbetaald>
            <!--Optional:-->
            <u_posid>?</u_posid>
            <!--Optional:-->
            <u_right_cabinet_id>?</u_right_cabinet_id>
            <!--Optional:-->
            <u_sixnet>?</u_sixnet>
            <!--Optional:-->
            <u_software_version_extra_1>?</u_software_version_extra_1>
            <!--Optional:-->
            <u_software_version_extra_2>?</u_software_version_extra_2>
            <!--Optional:-->
            <u_software_version_extra_3>?</u_software_version_extra_3>
            <!--Optional:-->
            <u_supervision_name>?</u_supervision_name>
            <!--Optional:-->
            <u_tmsid>?</u_tmsid>
            <!--Optional:-->
            <u_topdesk_customer_id>?</u_topdesk_customer_id>
            <!--Optional:-->
            <u_tuk_id>?</u_tuk_id>
            <!--Optional:-->
            <u_ucmdbid>?</u_ucmdbid>
            <!--Optional:-->
            <u_usb_j_n>?</u_usb_j_n>
            <!--Optional:-->
            <u_validators>?</u_validators>
            <!--Optional:-->
            <u_vcf_pkisam>?</u_vcf_pkisam>
            <!--Optional:-->
            <u_vehicle_index>?</u_vehicle_index>
            <!--Optional:-->
            <u_visible_customer>?</u_visible_customer>
            <!--Optional:-->
            <u_webservice_responses>?</u_webservice_responses>
            <!--Optional:-->
            <u_work_notes>?</u_work_notes>
            <!--Optional:-->
            <ucmdb_delete_date>?</ucmdb_delete_date>
            <!--Optional:-->
            <ucmdb_deleted>?</ucmdb_deleted>
            <!--Optional:-->
            <unverified>?</unverified>
            <!--Optional:-->
            <vendor>?</vendor>
            <!--Optional:-->
            <warranty_expiration>?</warranty_expiration>
         </record>
      </ucm:insertMultiple>
   </soapenv:Body>
</soapenv:Envelope>